reveal.js/reveal-help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>reveal.js bindings</title>
<!-- 2014-06-03 Tue 14:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Vladimir Alexiev" />
</head>
<body>
<div id="content">
<h1 class="title">reveal.js bindings</h1>
<p>
This presentation is proudly made in plain text with <a href="https://github.com/hakimel/reveal.js/">reveal.js</a>, <a href="https://github.com/yjwen/org-reveal">org-reveal</a>, <a href="http://orgmode.org">org-mode</a> and <a href="http://www.gnu.org/s/emacs/">emacs</a>.<br  />
The presentation is 2-dimensional: press 'o' to see the overview. Click or Enter to go into a slide<br  />
</p>
<table border="2" cellspacing="0" cellpadding="0" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Key</b></th>
<th scope="col" class="left"><b>Action</b></th>
</tr>
</thead>
<tbody>
<tr>
<th scope="row" class="left">h</th>
<td class="left">this keyboard help</td>
</tr>

<tr>
<th scope="row" class="left">p, page up</th>
<td class="left">prev slide (left or up)</td>
</tr>

<tr>
<th scope="row" class="left">n, page down</th>
<td class="left">next slide (right or down)</td>
</tr>

<tr>
<th scope="row" class="left">home</th>
<td class="left">first slide</td>
</tr>

<tr>
<th scope="row" class="left">end</th>
<td class="left">last slide</td>
</tr>

<tr>
<th scope="row" class="left">left</th>
<td class="left">go left</td>
</tr>

<tr>
<th scope="row" class="left">right</th>
<td class="left">go right</td>
</tr>

<tr>
<th scope="row" class="left">up</th>
<td class="left">go up</td>
</tr>

<tr>
<th scope="row" class="left">down</th>
<td class="left">go down</td>
</tr>

<tr>
<th scope="row" class="left">enter</th>
<td class="left">stop overview, go into slide</td>
</tr>

<tr>
<th scope="row" class="left">space</th>
<td class="left">next slide (or stop overview)</td>
</tr>

<tr>
<th scope="row" class="left">shift-space</th>
<td class="left">prev slide (or stop overview)</td>
</tr>

<tr>
<th scope="row" class="left">b, period</th>
<td class="left">blank/unblank screen</td>
</tr>

<tr>
<th scope="row" class="left">f, F11</th>
<td class="left">full screen (Esc or F11 to exit)</td>
</tr>

<tr>
<th scope="row" class="left">Esc, o</th>
<td class="left">toggle overview</td>
</tr>

<tr>
<th scope="row" class="left">s</th>
<td class="left">speaker window: notes, next slide, timer, controls the presentation</td>
</tr>

<tr>
<th scope="row" class="left">progress bar</th>
<td class="left">(bottom of window) move to that approximate slide</td>
</tr>

<tr>
<th scope="row" class="left">u</th>
<td class="left">toggle showing slide number in URL and in browser history</td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vladimir Alexiev</p>
<p class="date">Created: 2014-06-03 Tue 14:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.91.1 (<a href="http://orgmode.org">Org</a> mode 8.2.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
